'''
https://eolymp.com/uk/problems/775
Василь вирішив ретельно підготуватися до другого туру Олімпіади з інформатики. Для цього він хоче організувати 
для себе n маленьких олімпіад, кожна з яких складається з m задач. Щоб вигадати задачі для цих олімпіад, 
Василю потрібні збірники олімпіадних задач. Такі збірники є в бібліотеці. Відомо, що в бібліотеці рівно k збірників, 
а у i-му збірнику міститься рівно a_i задач. Василь може взяти будь-яку кількість збірників, але він не хоче брати 
зайвих збірників, які містять задачі, що не потрібні для підготовки до олімпіад. Тобто він хоче взяти мінімальну 
кількість збірників, які містять достатньо задач для підготовки до всіх n олімпіад, тобто не менше ніж m*n задач.

Вхідні дані
У першому рядку задано три натуральних числа k, m, n — кількість збірників у бібліотеці, кількість задач в одній 
олімпіаді та кількість олімпіад (1≤k≤100000, 1≤m,n≤10000). 
У другому рядку задано k натуральних чисел: a_1, a_2, …, a_k. Тут a_i (1≤a_i≤10^9) — кількість задач у i-му збірнику.

Вихідні дані
Виведіть мінімальну кількість збірників, які Василю потрібно взяти з бібліотеки. Вважається, що у бібліотеці 
достатньо збірників для підготовки задач для олімпіад.

Приклади
Вхідні дані #1
5 6 3
3 9 5 7 3
Відповідь #1
3
'''

# Функція для визначення мінімальної кількості збірників, які потрібно взяти
#  Бінарний пошук: Використовуємо бінарний пошук для знаходження мінімальної кількості збірників, які потрібно взяти, 
# щоб отримати достатньо задач для підготовки до олімпіад
def min_collections(k, m, n, collections):
    required_problems = m * n # Кількість задач, необхідна для підготовки до всіх олімпіад
    collections.sort(reverse=True)  # Сортуємо збірники за кількістю задач у спадному порядку
    
    low, high = 0, k  # Встановлюємо межі для бінарного пошуку
    while low < high:
        mid = (low + high) // 2  # Знаходимо середину між low і high
        if sum(collections[:mid]) >= required_problems:  # Якщо сума задач з перших mid збірників достатня для підготовки до олімпіад
            high = mid  # Зменшуємо верхню межу, щоб шукати меншу кількість збірників
        else:
            low = mid + 1  # Збільшуємо нижню межу, щоб шукати більшу кількість збірників
    
    return low  # Повертаємо мінімальну кількість збірників, які потрібно взяти


if __name__ == '__main__':
    k, m, n = map(int, input().split()) # Зчитуємо кількість збірників, кількість задач в одній олімпіаді та кількість олімпіад
    collections = list(map(int, input().split())) # Зчитуємо кількість задач у кожному збірнику
    print(min_collections(k, m, n, collections)) # Виводимо мінімальну кількість збірників, які потрібно взяти для підготовки до олімпіад