'''
https://eolymp.com/uk/problems/9017

Задано відсортований масив із n цілих чисел. Вам слід відповісти на q запитів: скільки разів задане число x 
міститься в масиві.

Вхідні дані
У першому рядку містяться два числа n і q (n,q≤10^6). Другий рядок містить n цілих чисел, відсортованих за зростанням. 
Кожен із наступних q рядків містить одне значення x. Усі числа в масиві за модулем не перевищують 10^9.

Вихідні дані
Для кожного значення x виведіть в окремому рядку кількість його входжень у масив.

Приклади
Вхідні дані #1
6 3
2 4 4 8 11 14
10
4
2
Відповідь #1
0
2
1
'''
# Функції для знаходження нижньої та верхньої межі для заданого числа x у відсортованому масиві
def lower_bound(arr, n, x): # знаходить індекс першого елемента, який не менший за x
    low, high = 0, n - 1 # до n, бо ми можемо повернути індекс n, якщо всі елементи менші за x
    while low <= high: # доки межі не перетинаються
        middle = (low + high) // 2
        if arr[middle] < x: # якщо середній елемент менший за x, то шукаємо в правій половині
            low = middle + 1
        else: # якщо середній елемент більший або рівний x, то шукаємо в лівій половині
            high = middle - 1
    return low # повертаємо індекс першого елемента, який не менший за x (arr[low] >= x або low == n)
 

def upper_bound(arr, n, x): # знаходить індекс першого елемента, який більший за x
    low, high = 0, n - 1 # до n, бо ми можемо повернути індекс n, якщо всі елементи менші або рівні за x
    while low <= high: # доки межі не перетинаються
        middle = (low + high) // 2
        if arr[middle] <= x: # якщо середній елемент менший або рівний x, то шукаємо в правій половині
            low = middle + 1
        else: # якщо середній елемент більший за x, то шукаємо в лівій половині
            high = middle - 1
    return high # повертаємо індекс останнього елемента, який не більший за x (arr[high] <= x або high == -1)'''


'''
def lower_bound(arr, n, x): # знаходить індекс першого елемента, який не менший за x
    low, high = 0, n # до n, бо ми можемо повернути індекс n, якщо всі елементи менші за x
    while low < high: # доки межі не перетинаються
        middle = (low + high) // 2
        if arr[middle] < x: # якщо середній елемент менший за x, то шукаємо в правій половині
            low = middle + 1
        else: # якщо середній елемент більший або рівний x, то шукаємо в лівій половині
            high = middle
    return low # повертаємо індекс першого елемента, який не менший за x
 

def upper_bound(arr, n, x): # знаходить індекс першого елемента, який більший за x
    low, high = 0, n # до n, бо ми можемо повернути індекс n, якщо всі елементи менші або рівні за x
    while low < high: # доки межі не перетинаються
        middle = (low + high) // 2
        if arr[middle] <= x: # якщо середній елемент менший або рівний x, то шукаємо в правій половині
            low = middle + 1
        else: # якщо середній елемент більший за x, то шукаємо в лівій половині
            high = middle
    return low # повертаємо індекс першого елемента, який більший за x
'''
    

if __name__ == '__main__':
    n, q = map(int, input().split())
    arr = list(map(int, input().split()))
    for _ in range(q):
        x = int(input())
        start = lower_bound(arr, n, x) # індекс першого елемента, який не менший за x
        print(f"start = {start}")
        end = upper_bound(arr, n, x) # індекс останнього елемента, який не більший за x
        print(f"end = {end}")
        count = end - start + 1 # кількість входжень x у масив дорівнює різниці між індексом першого елемента, 
        # який більший за x, та індексом першого елемента, який не менший за x мінус 1 (бо ми включаємо елемент на індексі start)
        # count = end - start
        print(count)