from math import log2

# Функція, яка ділить число n на 2, поки воно не стане меншим або рівним 1, і рахує кількість ділень
def divide_till_one(n):
    divisions = 0 # Лічильник кількості ділень
    while n > 1: # Поки n більше 1, продовжуємо ділити
        n = n // 2 # Ділимо n на 2
        divisions += 1 # Збільшуємо лічильник ділень на 1
    return divisions


# Порівняння результатів функції divide_till_one з логарифмом за основою 2
for d in range(1, 10):
    n = 10 ** d # Створюємо число n, яке є 10 в степені d
    # Виводимо n, log2(n) та результат функції divide_till_one(n) для порівняння
    print(f'{n} {log2(n)} {divide_till_one(n)}')
