# https://eolymp.com/uk/problems/6190
'''
Напишіть програму, яка знаходить два послідовні прості числа x та y, знаючи їх добуток
'''

from math import ceil, sqrt 

prod = int(input())

# Два послідовні прості числа знаходяться поруч, а між ними корінь їх добутку. Тому починаємо пошук 
# з найближчого до кореня числа і рухаємося вгору, поки не знайдемо просте число. Потім перевіряємо, 
# чи є наступне просте число добутком з першим.
y = ceil(sqrt(prod)) # починаємо з більшогонайближчого до кореня числа  
for x in range(y -1, 1, -1):
    if prod % x == 0: # якщо x ділить добуток, то y = prod // x
        print(x, prod // x) # виводимо знайдені прості числа
        break