def knapSack(weights, s):
    n = len(weights)
    # Створюємо масив dp розміром (s + 1).
    # dp[i] буде True, якщо ми можемо набрати вагу рівно i, і False інакше.
    dp = [False] * (s + 1)

    # Вагу 0 можна набрати завжди (не беручи жодного зливка)
    dp[0] = True

    # Перебираємо кожен золотий зливок
    # Чому зворотний цикл(range(s, w - 1, -1))?:
    # Це ключовий момент одновимірного динамічного програмування для рюкзака.
    # Якщо ми будемо йти спочатку(від w до s), ми можемо використати один і той самий зливок кілька разів для
    # збільшення ваги(це була б задача про необмежену кількість предметів).
    # Йдучи з кінця, ми гарантуємо, що для поточної ваги j ми використовуємо стан dp[j - w], який був розрахований
    # ще до того, як ми розглянули поточний зливок.
    for w in weights:
        # Йдемо по масиву dp з кінця до w (зворотний порядок важливий,
        # щоб не врахувати один і той самий зливок кілька разів).
        for j in range(s, w - 1, -1):
            # Якщо ми могли набрати вагу (j - w), то додавши цей зливок,
            # ми зможемо набрати вагу j.
            if dp[j - w]:
                dp[j] = True

    # Шукаємо найбільший індекс i, для якого dp[i] == True
    for i in range(s, -1, -1):
        if dp[i]:
            print(i)
            break


if __name__ == "__main__":
    # Зчитуємо всі вхідні дані
    # Перше число — місткість рюкзака S
    s = int(input())
    # Решта чисел — ваги зливків
    weights = list(map(int, input().split()))
    knapSack(weights, s)