'''
### Задача «Покриття відрізків точками»

Знайдіть мінімальну кількість точок, необхідних для покриття всіх заданих відрізків на прямій.

**Опис:**
Ви відповідаєте за збір підписів від усіх мешканців будинку. Для кожного мешканця ви знаєте проміжок часу, коли він або 
вона перебуває вдома. Ви б хотіли зібрати всі підписи, відвідавши будинок якомога меншу кількість разів. 
Для спрощення вважаємо, що коли ви заходите в будинок, ви миттєво збираєте підписи всіх мешканців, які перебувають у будинку 
в цей момент.

*Спробуйте нашу інтерактивну головоломку «Торкнися всіх відрізків» перед тим, як розв'язувати цю задачу!*

* **Вхідні дані:** Послідовність із $n$ відрізків $[l_1, r_1], \dots, [l_n, r_n]$ на прямій.
* **Вихідні дані:** Множина точок мінімального розміру така, що кожен відрізок $[l_i, r_i]$ містить хоча б одну точку (тобто існує точка $x$ із цієї множини така, що $l_i \le x \le r_i$).

---

### Формат вхідних та вихідних даних

* **Формат вхідних даних:**
Перший рядок містить число $n$ — кількість відрізків.
Кожен із наступних $n$ рядків містить два цілих числа $l_i$ та $r_i$ (через пробіл), що задають координати кінців $i$-го відрізка.
* **Формат вихідних даних:**
У першому рядку виведіть мінімальну кількість точок $k$.
У другому рядку виведіть цілочисельні координати цих $k$ точок (через пробіл). Ви можете виводити точки у довільному порядку. 
Якщо існує кілька таких множин точок, виведіть будь-яку з них.
* **Обмеження:**
$1 \le n \le 100$;
$0 \le l_i \le r_i \le 10^9$ для всіх $i$.

---

### Приклади

#### Приклад 1

**Вхідні дані:**

```text
3
1 3
2 5
3 6

```

**Вихідні дані:**

```text
1
3

```

*Пояснення:* Усі три відрізки $[1, 3]$, $[2, 5]$ та $[3, 6]$ містять точку з координатою $3$.

#### Приклад 2

**Вхідні дані:**

```text
4
4 7
1 3
2 5
5 6

```

**Вихідні дані:**

```text
2
3 6

```

*Пояснення:* Другий і третій відрізки містять точку з координатою $3$, тоді як перший і четвертий містять точку з 
координатою $6$. Усі відрізки неможливо покрити однією точкою, оскільки відрізки $[1, 3]$ та $[5, 6]$ не перетинаються. 
Іншим правильним розв'язком у цьому випадку є множина точок $2$ і $5$.
'''


from collections import namedtuple

def coveringSegmentsByPoints(segments, n):
    segments.sort(key=lambda x: x.end)
    points = []
    '''
    for i in range(n):
        if not segments[i].visited:
            point = segments[i].end
            points.append(point)
            for j in range(i + 1, n):
                if segments[j].start <= point and not segments[j].visited:
                    segments[j] = segments[j]._replace(visited=True)
    '''
    last_point = -1
    for segment in segments:
        if last_point < segment.start:
            last_point = segment.end
            points.append(last_point)
    return points



Segment = namedtuple('Segment', ['start', 'end', 'visited'])

n = int(input())
segments = []
for i in range(n):
    start, end = map(int, input().split())
    segments.append(Segment(start, end, False))

points = coveringSegmentsByPoints(segments, n)
print(len(points))
print(*points)

