'''
https://eolymp.com/uk/problems/10355

Переїхавши у велике місто, Козак Вус вирішив, що йому слід зайнятись малим бізнесом, тому відкрив невеличку 
ювелірну крамницю. У нього є n ювелірних виробів, ціна i-го з них рівна a[i] .

Але внаслідок епідемії продаж ювелірних виробів знизився, тому Козак Вус вирішив зробити акційний розпродаж. 
За умовами акції, покупець може:

Вибрати деяке додатне число k.

Придбати усі m ювелірних виробів з ціною не менше, ніж k, за k⋅m монет загалом. Іншими словами, кожен виріб, 
у якого a[i] ≥k, він купить за k.

Тепер Козак Вус зацікавився, якою буде максимальна сума, виплачена за акційною пропозицією.
'''

import sys

def solve():
    # Зчитуємо кількість елементів
    
    n = int(input())
    
    # Зчитуємо ціни та перетворюємо у список цілих чисел
    a = list(map(int, input().split()))
    
    # Сортуємо ціни за зростанням
    a.sort()
    
    max_income = 0 # змінна для збереження максимального прибутку
    
    # Перебираємо всі можливі варіанти k (де k = a[i])
    for i in range(n):
        # Поточне k = a[i]
        # Кількість виробів, ціна яких >= a[i], це (n - i)
        current_k = a[i]
        m = n - i # кількість виробів, які будуть куплені за поточним k
        
        current_income = current_k * m # сума, яку отримає Козак Вус за поточним k
        
        # Оновлюємо максимальний прибуток
        if current_income > max_income:
            max_income = current_income 
            
    print(max_income)

if __name__ == "__main__":
    solve()