'''
https://eolymp.com/uk/problems/6198
Є два масиви натуральних чисел a[1..n] та b[1..n]. Знайдіть перестановку i 
(1 ≤ i ≤ n) таку, що сума a[i] * b[i] буде мінімальною. 
У перестановку кожне число повинно входити лише один раз.
'''

n = int(input())
a = list(map(int, input().split()))
b = list(map(int, input().split()))
# Щоб мінімізувати суму a[i] * b[i], потрібно відсортувати один масив за зростанням, а інший - за спаданням.
a.sort() # сортуємо масив a за зростанням
b.sort(reverse=True) # сортуємо масив b за спаданням        
result = sum(x * y for x, y in zip(a, b)) # обчислюємо суму добутків відповідних елементів
print(result) # виводимо результат