'''
https://eolymp.com/uk/problems/2323

Задано невід’ємне ціле число n. Використовуючи всі його цифри, утворіть найбільше можливе число, а потім — найменше. 
Виведіть суму цих двох чисел.

Наприклад, для n=56002 найбільше число — 65200, а найменше — 256 (початкові нулі в числі 00256 не враховуються). 
Необхідна сума: 65200+256=65456.
'''

n = input() # зчитуємо вхідне число як рядок, щоб працювати з його цифрами
min_num = sorted(n) # сортуємо цифри в порядку зростання для формування найменшого числа
max_num = sorted(n, reverse=True) # сортуємо цифри в порядку спадання для формування найбільшого числа

sum_num = int(''.join(min_num)) + int(''.join(max_num)) # об'єднуємо цифри в рядки, перетворюємо на числа і обчислюємо суму
print(sum_num) # виводимо результат